<a href="https://colab.research.google.com/github/LaraDondossola/Estatistica_aplicada/blob/main/lista001.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import numpy as np
import pandas as pd
from pandas import Series
from pandas import DataFrame

In [4]:
serie = Series([1, 2, 3, 4, 5])

serie2 = Series([10, 15, 20, 30, 25, 24, 25], index = ['domingo', 'segunda', 'terça', 'quarta', 'quinta', 'sexta', 'sábado'])

serie2.name = "temperatura"

serie2.index.name = "dia-semana"

serie2

dia-semana
domingo    10
segunda    15
terça      20
quarta     30
quinta     25
sexta      24
sábado     25
Name: temperatura, dtype: int64

In [5]:
print(serie[2]) #mostrar o 3º elemento da série

3

In [6]:
serie2 = Series([5, 15, 8, 20, 10])

serie[serie2>10] #elementos da série > 10

1    2
3    4
dtype: int64

In [7]:
serie_letras = Series([1, 2, 3, 4], index = ['a', 'b', 'c', 'd'])

serie_letras[['b', 'c', 'd']] #mostrar elementos de 'b' até 'e'

b    2
c    3
d    4
dtype: int64

In [8]:
serie01 = Series([1, 2, 3, 4])
serie02 = Series([5, 6, 7, 8])

serie01 + serie02 #faz a soma por índices

0     6
1     8
2    10
3    12
dtype: int64

In [9]:
serie_numeros = Series([1, 2, 3, 4])

serie_numeros * 2 #pode manipular dados (sem print)

0    2
1    4
2    6
3    8
dtype: int64

In [10]:
print(serie_numeros * 2) #somente imprimir para usuário

0    2
1    4
2    6
3    8
dtype: int64

In [11]:
serie_valores = Series([10, 20, 30, 40])

print(serie_valores.mean()) #.mean() é um método pronto do pandas para calcular média

25.0

In [12]:
serie_existente = Series([1, 2, 3, 4], index = ['a', 'b', 'c', 'd'])

serie_existente['e'] = 5

print(serie_existente[4]) #confirmar se o elemento foi adicionado, procurar pelo índice [4]
serie_existente['e'] #procurar pelo índice ['e']

5

/tmp/ipython-input-3425502286.py:5: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(serie_existente[4]) #confirmar se o elemento foi adicionado, procurar pelo índice [4]

np.int64(5)

In [30]:
serie_valores2 = Series([10, 20, 30, 40], index = ['a', 'b', 'c', 'd'])

serie_valores2.drop('b') #remove o 'b'

a    10
c    30
d    40
dtype: int64

In [15]:
serie_numeros2 = Series([10, 20, 30, 40], index = ['a', 'b', 'c', 'd'])

serie_numeros2['a'] = 5 #para alterar um elemento

serie_numeros2

a     5
b    20
c    30
d    40
dtype: int64

In [19]:
serie_duplicada = Series([1, 2, 2, 3, 3, 4, 4])

print(serie_duplicada.unique()) #encontrar os valores unicos sem repetição

[1 2 3 4]

In [24]:
serie_numeros3 = Series([1, 2, 3, 4, 5])

4 in serie_numeros3 #verificar se um número existe nessa série

True

In [29]:
serie_desordenada = Series([3, 1, 4, 2, 5])

serie_desordenada.sort_values() #ordena os valores em ordem crescente

1    1
3    2
0    3
2    4
4    5
dtype: int64

In [35]:
serie_valores3 = Series([10, 20, 30, 40], index = ['a', 'b', 'c', 'd'])

serie_valores3.index = 'e', 'f', 'g', 'h' #para alterar o nome dos índices

serie_valores3

e    10
f    20
g    30
h    40
dtype: int64

In [37]:
serie_com_indices = Series([10, 20, 30, 40], index = ['a', 'b', 'c', 'd'])

serie_com_indices.reset_index(drop=True) #reset nos índices

0    10
1    20
2    30
3    40
dtype: int64

In [38]:
serie_com_nan = Series([10, 20, np.nan, 40, np.nan])

serie_com_nan.dropna() #.dropna remover NaN

0    10.0
1    20.0
3    40.0
dtype: float64

In [40]:
serie_com_nan.fillna(0) #.fillna(0) preenche os valores vazios com zero

0    10.0
1    20.0
2     0.0
3    40.0
4     0.0
dtype: float64